#  <b>1 Introdução</b>

In [22]:
import pandas as pd
#dica para visualização
# pd.set_option('display.max_rows', 600)
pd.set_option('display.max_columns', 10)

In [ ]:
dataset = pd.read_csv('db.csv', sep = ';')
dataset

In [24]:
dataset.dtypes

Nome              object
Motor             object
Ano                int64
Quilometragem    float64
Zero_km             bool
Acessórios        object
Valor            float64
dtype: object

In [25]:
dataset[['Quilometragem', 'Valor']].describe()

       Quilometragem          Valor
count     197.000000     258.000000
mean    58278.421320   98960.513101
std     35836.733259   29811.932305
min       107.000000   50742.100000
25%     27505.000000   70743.512500
50%     55083.000000   97724.380000
75%     90495.000000  124633.302500
max    119945.000000  149489.920000

In [26]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 258 entries, 0 to 257
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Nome           258 non-null    object
 1   Motor          258 non-null    object
 2   Ano            258 non-null    int64
 3   Quilometragem  197 non-null    float64
 4   Zero_km        258 non-null    bool
 5   Acessórios     258 non-null    object
 6   Valor          258 non-null    float64
dtypes: bool(1), float64(2), int64(1), object(3)
memory usage: 12.5+ KB

# <b> 2 tuplas</b>

In [29]:
nome_carros = ("Jetta", "Passat",("Fusca", "Gol", "C4"))
nome_carros[-1][2]

'C4'

* resolução exercício

In [31]:
carros = (
    (
        'Jetta Variant',
        'Motor 4.0 Turbo',
        2003,
        False,
        ('Rodas de liga', 'Travas elétricas', 'Piloto automático')
    ),
    (
        'Passat',
        'Motor Diesel',
        1991,
        True,
        ('Central multimídia', 'Teto panorâmico', 'Freios ABS')
    )
)
carros[0][3]
carros[-1][-1][-1]
carros[0][-1][:2]

'Freios ABS'

In [37]:
nome_carros = ("Jetta", "Passat","Fusca", "Gol", "C4")
for carro in nome_carros:
    print(carro)

carro_1, carro_2, carro_3, carro_4, carro_5 = nome_carros

Jetta
Passat
Fusca
Gol
C4

* Atribuindo e ignorando carros

In [42]:
_, A, _, B, _= nome_carros
A

'Passat'

 ### <b> Zip  </b>

In [6]:
nome_carros = ("Jetta", "Passat","Fusca", "Gol", "C4")
valores = (200000, 60563, 25000, 69000, 10000)

In [47]:
zip(nome_carros, valores)
list(zip(nome_carros, valores))

[('Jetta', 200000),
 ('Passat', 60563),
 ('Fusca', 25000),
 ('Gol', 69000),
 ('C4', 10000)]

* Exercício

In [57]:
carros = (
    (
        'Jetta Variant',
        'Motor 4.0 Turbo',
        2003,
        False,
        ('Rodas de liga', 'Travas elétricas', 'Piloto automático')
    ),
    (
        'Passat',
        'Motor Diesel',
        1991,
        True,
        ('Central multimídia', 'Teto panorâmico', 'Freios ABS')
    )
)
for tupla in carros:
    for item in tupla[-1]:
        print(item)

Rodas de liga
Travas elétricas
Piloto automático
Central multimídia
Teto panorâmico
Freios ABS

# <b> 3 Dicionários </b>

In [3]:
dados = {'Fusca' : 80450, 'Gol' : 69000, 'Passat' : 587400}
dados

{'Fusca': 80450, 'Gol': 69000, 'Passat': 587400}

In [8]:
dados_1 = dict(zip(nome_carros, valores))
dados_1

{'Jetta': 200000, 'Passat': 60563, 'Fusca': 25000, 'Gol': 69000, 'C4': 10000}

### Operando nos dicionários

Consultando dado no dic

In [10]:
dados['Passat']

587400

In [13]:
dados['Fiesta'] = 63555
dados

{'Fusca': 80450, 'Gol': 69000, 'Passat': 587400, 'Fiesta': 63555}

In [16]:
del dados ['Fusca']
dados

{'Gol': 69000, 'Fiesta': 63555}

In [22]:
dados.update({'Passat': 60563})
dados

dados.update({'Passat': 80003, 'Fusca': 56600})
dados

{'Gol': 69000, 'Fiesta': 63555, 'Passat': 80003, 'Fusca': 56600}

In [26]:
dadosCopy = dados.copy()
dadosCopy.update({'Saveiro': 65000})
dadosCopy

{'Gol': 69000,
 'Fiesta': 63555,
 'Passat': 80003,
 'Fusca': 56600,
 'Saveiro': 65000}

In [ ]:
dadosCopy.pop('Passat')

In [35]:
dadosCopy.pop("Passat", "Dados não encontrado")

'Dados não encontrado'

In [36]:
dadosCopy.clear()

Interação com dicionários

In [39]:
dados.keys()

dict_keys(['Gol', 'Fiesta', 'Passat', 'Fusca'])

In [44]:
for key in dados.keys():
    print(dados[key])

69000
63555
80003
56600

In [46]:
dados.values()

dict_values([69000, 63555, 80003, 56600])

In [47]:
dados.items()

dict_items([('Gol', 69000), ('Fiesta', 63555), ('Passat', 80003), ('Fusca', 56600)])

In [49]:
for item in dados.items():
    print(item)

('Gol', 69000)
('Fiesta', 63555)
('Passat', 80003)
('Fusca', 56600)

In [51]:
for key, values in dados.items():
    print(key, values)

Gol 69000
Fiesta 63555
Passat 80003
Fusca 56600

In [57]:
for key, values in dados.items():
    if values >60000:
        print(key)

Gol
Fiesta
Passat

#### Exercício
- Selecione a alternativa que apresenta o código que imprime somente os nomes dos veículos com ano de fabricação maior ou igual a 2000.

In [68]:
dado = {
    'Crossfox': {'valor': 72000, 'ano': 2005}, 
    'DS5': {'valor': 125000, 'ano': 2015}, 
    'Fusca': {'valor': 150000, 'ano': 1976}, 
    'Jetta': {'valor': 88000, 'ano': 2010}, 
    'Passat': {'valor': 106000, 'ano': 1998}
}
for item in dado.items():
    if item[1]['ano']>= 2000:
        print(item[0])

Crossfox
DS5
Jetta

# <b> 4 Funções</b>

In [45]:
dados = {'Fusca' : 80450, 'Gol' : 69000, 'Passat' : 587400}
valores = []
for valor in dados.values():
    print(valor)

80450
69000
587400

In [5]:
list(dados.values())

[80450, 69000, 587400]

In [46]:
sum(dados.values())

736850

Dessa maneira com print, não é possível atribuir o valor a uma variável, o correto
seria usar o return.

In [48]:
def media(list):
    valor = sum(list) / len(list)
    print(valor)

In [52]:
media([1,66,988,333,11,33,22,33])
resultado = media

185.875

In [53]:
resultado

In [57]:
def media(list):
    valor = sum(list) / len(list)
    return valor

In [61]:
media([22,33,66,99,88,11,33])

50.285714285714285

In [64]:
resultado = media([22,33,66,99,88,11,33])

In [65]:
resultado

50.285714285714285

# <b> Pandas Básico</b>

In [85]:
import pandas as pd

In [87]:
carros = ['Jetta', 'Fiesta', 'Saveiro', 'Fusca']
carros

['Jetta', 'Fiesta', 'Saveiro', 'Fusca']

In [88]:
pd.Series(carros)

0      Jetta
1     Fiesta
2    Saveiro
3      Fusca
dtype: object

In [90]:
dados = [
    {'Nome': 'Fiesta','Motor': 'Motor 1.0', 'Ano': 2014, 'Zero_km': False, 'Valor': 45000 },
    {'Nome': 'Gol','Motor': 'Motor 1.0', 'Ano': 2010, 'Zero_km': False, 'Valor': 24000 },
    {'Nome': 'Saveiro','Motor': 'Motor 1.6', 'Ano': 2011, 'Zero_km': False, 'Valor': 36000 },
    {'Nome': 'Fusca','Motor': 'Motor 2.0', 'Ano': 2014, 'Zero_km': False, 'Valor': 25000 }
]

In [92]:
dataset = pd.DataFrame(dados)
dataset

      Nome      Motor   Ano  Zero_km  Valor
0   Fiesta  Motor 1.0  2014    False  45000
1      Gol  Motor 1.0  2010    False  24000
2  Saveiro  Motor 1.6  2011    False  36000
3    Fusca  Motor 2.0  2014    False  25000

modificando a ordem

In [94]:
dataset[['Nome', 'Zero_km', 'Ano', 'Motor', 'Valor']]

      Nome  Zero_km   Ano      Motor  Valor
0   Fiesta    False  2014  Motor 1.0  45000
1      Gol    False  2010  Motor 1.0  24000
2  Saveiro    False  2011  Motor 1.6  36000
3    Fusca    False  2014  Motor 2.0  25000

Dicionario organizado em lista

In [96]:
dados = {
    'Nome': ['Jetta Variant', 'Passat', 'Crossfox'], 
    'Motor': ['Motor 4.0 Turbo', 'Motor Diesel', 'Motor Diesel V8'],
    'Ano': [2003, 1991, 1990],
    'Quilometragem': [44410.0, 5712.0, 37123.0],
    'Zero_km': [False, False, False],
    'Valor': [88078.64, 106161.94, 72832.16]
}

In [98]:
dataset = pd.DataFrame(dados)
dataset

            Nome            Motor   Ano  Quilometragem  Zero_km      Valor
0  Jetta Variant  Motor 4.0 Turbo  2003        44410.0    False   88078.64
1         Passat     Motor Diesel  1991         5712.0    False  106161.94
2       Crossfox  Motor Diesel V8  1990        37123.0    False   72832.16

Dataframe a partir de dados externos

In [117]:
dataset = pd.read_csv('db.csv', sep= ';',index_col= 0)#nome como index 0
dataset

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
Jetta Variant,Motor 4.0 Turbo,2003,44410.0,False,"['Rodas de liga', 'Travas elétricas', 'Piloto ...",88078.64
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94
Crossfox,Motor Diesel V8,1990,37123.0,False,"['Piloto automático', 'Controle de estabilidad...",72832.16
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Aston Martin DB4,Motor 2.4 Turbo,2006,25757.0,False,"['Rodas de liga', '4 X 4', 'Central multimídia...",92612.10
...,...,...,...,...,...,...
Phantom 2013,Motor V8,2014,27505.0,False,"['Controle de estabilidade', 'Piloto automátic...",51759.58
Cadillac Ciel concept,Motor V8,1991,29981.0,False,"['Bancos de couro', 'Painel digital', 'Sensor ...",51667.06
Classe GLK,Motor 5.0 V8 Bi-Turbo,2002,52637.0,False,"['Rodas de liga', 'Controle de tração', 'Câmbi...",68934.03
Aston Martin DB5,Motor Diesel,1996,7685.0,False,"['Ar condicionado', '4 X 4', 'Câmbio automátic...",122110.90
Macan,Motor Diesel V6,1992,50188.0,False,"['Central multimídia', 'Teto panorâmico', 'Vid...",90381.47

In [118]:
dataset.head()

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
Jetta Variant,Motor 4.0 Turbo,2003,44410.0,False,"['Rodas de liga', 'Travas elétricas', 'Piloto ...",88078.64
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94
Crossfox,Motor Diesel V8,1990,37123.0,False,"['Piloto automático', 'Controle de estabilidad...",72832.16
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Aston Martin DB4,Motor 2.4 Turbo,2006,25757.0,False,"['Rodas de liga', '4 X 4', 'Central multimídia...",92612.10

Exibindo coluna desejada

In [119]:
dataset['Valor']

Nome
Jetta Variant             88078.64
Passat                   106161.94
Crossfox                  72832.16
DS5                      124549.07
Aston Martin DB4          92612.10
                           ...
Phantom 2013              51759.58
Cadillac Ciel concept     51667.06
Classe GLK                68934.03
Aston Martin DB5         122110.90
Macan                     90381.47
Name: Valor, Length: 258, dtype: float64

Transformando coluna desejada em dataframe

In [120]:
dataset[['Valor']]

                           Valor
Nome
Jetta Variant           88078.64
Passat                 106161.94
Crossfox                72832.16
DS5                    124549.07
Aston Martin DB4        92612.10
...                          ...
Phantom 2013            51759.58
Cadillac Ciel concept   51667.06
Classe GLK              68934.03
Aston Martin DB5       122110.90
Macan                   90381.47

[258 rows x 1 columns]

Selecionado linhas

In [121]:
dataset[0:4]#slice

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
Jetta Variant,Motor 4.0 Turbo,2003,44410.0,False,"['Rodas de liga', 'Travas elétricas', 'Piloto ...",88078.64
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94
Crossfox,Motor Diesel V8,1990,37123.0,False,"['Piloto automático', 'Controle de estabilidad...",72832.16
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07

#### Exercício
Calcular km médio

In [82]:
dados = {
    'Crossfox': {'km': 35000, 'ano': 2005}, 
    'DS5': {'km': 17000, 'ano': 2015}, 
    'Fusca': {'km': 130000, 'ano': 1979}, 
    'Jetta': {'km': 56000, 'ano': 2011}, 
    'Passat': {'km': 62000, 'ano': 1999}
}

In [43]:
#entendeno a estrutura
dados.items()
for item in dados.items():
    print(item[1]['ano'])

2005
2015
1979
2011
1999

In [31]:


def km_media(dataset, ano_atual):
    for item in dataset.items():
        result = item[1]['km'] / (ano_atual - item[1]['ano'])
        print(result)

km_media(dados, 2022)

2058.823529411765
2428.5714285714284
3023.2558139534885
5090.909090909091
2695.6521739130435

In [83]:
def km_media(dataset, ano_atual):
    result = {}
    for item in dataset.items():
        media = item[1]['km'] / (ano_atual - item[1]['ano'])
        result.update({ item[0]: media })
    return result
km_media(dados, 2022)

{'Crossfox': 2058.823529411765,
 'DS5': 2428.5714285714284,
 'Fusca': 3023.2558139534885,
 'Jetta': 5090.909090909091,
 'Passat': 2695.6521739130435}

Exercício
Transoformar dicionario em dataframe

In [114]:
dados = {
    'Crossfox': {'km': 35000, 'ano': 2005}, 
    'DS5': {'km': 17000, 'ano': 2015}, 
    'Fusca': {'km': 130000, 'ano': 1979}, 
    'Jetta': {'km': 56000, 'ano': 2011}, 
    'Passat': {'km': 62000, 'ano': 1999}
}

def km_media(dataset, ano_atual):
    result = {}
    for item in dataset.items():
        media = item[1]['km'] / (ano_atual - item[1]['ano'])
        item[1].update({ 'km_media': media })
        result.update({ item[0]: item[1] })

    return result

km_media(dados, 2022)

{'Crossfox': {'km': 35000, 'ano': 2005, 'km_media': 2058.823529411765},
 'DS5': {'km': 17000, 'ano': 2015, 'km_media': 2428.5714285714284},
 'Fusca': {'km': 130000, 'ano': 1979, 'km_media': 3023.2558139534885},
 'Jetta': {'km': 56000, 'ano': 2011, 'km_media': 5090.909090909091},
 'Passat': {'km': 62000, 'ano': 1999, 'km_media': 2695.6521739130435}}

In [116]:
# carros = pd.DataFrame(resultado).T
# carros

                km     ano     km_media
Crossfox   35000.0  2005.0  2058.823529
DS5        17000.0  2015.0  2428.571429
Fusca     130000.0  1979.0  3023.255814
Jetta      56000.0  2011.0  5090.909091
Passat     62000.0  1999.0  2695.652174

In [113]:
carros = pd.DataFrame(km_media(dados, 2022)).T
carros

                km     ano     km_media
Crossfox   35000.0  2005.0  2058.823529
DS5        17000.0  2015.0  2428.571429
Fusca     130000.0  1979.0  3023.255814
Jetta      56000.0  2011.0  5090.909091
Passat     62000.0  1999.0  2695.652174